apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
/****************************************************************************
 * arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdint.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/spinlock.h>

#include "clock/clock.h"
#include "riscv_internal.h"
#include "hardware/esp32c3_rtccntl.h"
#include "hardware/esp32c3_soc.h"
#include "hardware/esp32c3_system.h"
#include "hardware/esp32c3_syscon.h"
#include "hardware/esp32c3_tim.h"
#include "hardware/apb_ctrl_reg.h"
#include "hardware/bb_reg.h"
#include "hardware/nrx_reg.h"
#include "hardware/fe_reg.h"
#include "hardware/regi2c_lp_bias.h"
#include "hardware/regi2c_dig_reg.h"
#include "hardware/regi2c_bbpll.h"
#include "hardware/regi2c_ctrl.h"
#include "hardware/extmem_reg.h"
#include "hardware/spi_mem_reg.h"
#include "hardware/esp32c3_efuse.h"

#include "esp32c3_clockconfig.h"
#include "esp32c3_attr.h"
#include "esp32c3_rt_timer.h"

#include "esp32c3_rtc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define OTHER_BLOCKS_POWERUP        1
#define OTHER_BLOCKS_WAIT           1

#define STR2(X) #X
#define STR(X) STR2(X)

#define MHZ                        (1000000)

/* Lower threshold for a reasonably-looking calibration value for a 32k XTAL.
 * The ideal value (assuming 32768 Hz frequency)
 * is 1000000/32768*(2**19) = 16*10^6.
 */

#define MIN_32K_XTAL_CAL_VAL        15000000L
#define DELAY_FAST_CLK_SWITCH       3
#define DELAY_SLOW_CLK_SWITCH       300
#define DELAY_8M_ENABLE             50

/* Indicates that this 32k oscillator gets input from external oscillator,
 * rather than a crystal.
 */

#define EXT_OSC_FLAG    BIT(3)

#define RTC_FAST_CLK_FREQ_8M        8500000

/* With the default value of CK8M_DFREQ,
 * 8M clock frequency is 8.5 MHz +/- 7%.
 */

#define RTC_FAST_CLK_FREQ_APPROX    8500000

#define RTC_PLL_FREQ_320M   320
#define RTC_PLL_FREQ_480M   480

#define RTC_SLOW_CLK_FREQ_90K      90000
#define RTC_SLOW_CLK_FREQ_8MD256    (RTC_FAST_CLK_FREQ_APPROX / 256)
#define RTC_SLOW_CLK_FREQ_32K       32768

#define RTC_SLOW_CLK_X32K_CAL_TIMEOUT_THRES(cycles)   (cycles << 12)
#define RTC_SLOW_CLK_8MD256_CAL_TIMEOUT_THRES(cycles) (cycles << 12)
#define RTC_SLOW_CLK_150K_CAL_TIMEOUT_THRES(cycles)   (cycles << 10)

/* Number of fractional bits in values returned by rtc_clk_cal */

#define RTC_CLK_CAL_FRACT  19

/* set sleep_init default param. */

#define RTC_CNTL_DBG_ATTEN_LIGHTSLEEP_DEFAULT  3
#define RTC_CNTL_DBG_ATTEN_DEEPSLEEP_DEFAULT  15
#define RTC_CNTL_DBG_ATTEN_MONITOR_DEFAULT  0
#define RTC_CNTL_BIASSLP_MONITOR_DEFAULT  0
#define RTC_CNTL_BIASSLP_SLEEP_DEFAULT  1
#define RTC_CNTL_PD_CUR_MONITOR_DEFAULT  0
#define RTC_CNTL_PD_CUR_SLEEP_DEFAULT  1
#define RTC_CNTL_DG_VDD_DRV_B_SLP_DEFAULT 254

#define RTC_CK8M_ENABLE_WAIT_DEFAULT 5

/* Approximate mapping of voltages to RTC_CNTL_DBIAS_WAK,
 * RTC_CNTL_DBIAS_SLP, RTC_CNTL_DIG_DBIAS_WAK,
 * RTC_CNTL_DIG_DBIAS_SLP values. Valid if RTC_CNTL_DBG_ATTEN is 0.
 */

#define RTC_CNTL_DBIAS_SLP  0
#define RTC_CNTL_DBIAS_0V90 13
#define RTC_CNTL_DBIAS_0V95 16
#define RTC_CNTL_DBIAS_1V00 18
#define RTC_CNTL_DBIAS_1V05 20
#define RTC_CNTL_DBIAS_1V10 23
#define RTC_CNTL_DBIAS_1V15 25
#define RTC_CNTL_DBIAS_1V20 28
#define RTC_CNTL_DBIAS_1V25 30
#define RTC_CNTL_DBIAS_1V30 31

#define DIG_DBIAS_XTAL      RTC_CNTL_DBIAS_1V10
#define DIG_DBIAS_2M        RTC_CNTL_DBIAS_1V00

#define DIG_DBIAS_80M   RTC_CNTL_DBIAS_1V20
#define DIG_DBIAS_160M  RTC_CNTL_DBIAS_1V20

/* Default initializer for esp32c3_rtc_sleep_config_s
 * This initializer sets all fields to "reasonable" values
 * (e.g. suggested for production use) based on a combination
 * of RTC_SLEEP_PD_x flags.
 */

#define RTC_SLEEP_CONFIG_DEFAULT(sleep_flags) { \
  .lslp_mem_inf_fpu = 0, \
  .rtc_mem_inf_follow_cpu = ((sleep_flags) & RTC_SLEEP_PD_RTC_MEM_FOLLOW_CPU) ? 1 : 0, \
  .rtc_fastmem_pd_en = ((sleep_flags) & RTC_SLEEP_PD_RTC_FAST_MEM) ? 1 : 0, \
  .rtc_slowmem_pd_en = ((sleep_flags) & RTC_SLEEP_PD_RTC_SLOW_MEM) ? 1 : 0, \
  .rtc_peri_pd_en = ((sleep_flags) & RTC_SLEEP_PD_RTC_PERIPH) ? 1 : 0, \
  .wifi_pd_en = ((sleep_flags) & RTC_SLEEP_PD_WIFI) ? 1 : 0, \
  .bt_pd_en = ((sleep_flags) & RTC_SLEEP_PD_BT) ? 1 : 0, \
  .cpu_pd_en = ((sleep_flags) & RTC_SLEEP_PD_CPU) ? 1 : 0, \
  .dig_peri_pd_en = ((sleep_flags) & RTC_SLEEP_PD_DIG_PERIPH) ? 1 : 0, \
  .deep_slp = ((sleep_flags) & RTC_SLEEP_PD_DIG) ? 1 : 0, \
  .wdt_flashboot_mod_en = 0, \
  .dig_dbias_wak = RTC_CNTL_DBIAS_1V10, \
  .dig_dbias_slp = RTC_CNTL_DBIAS_SLP, \
  .rtc_dbias_wak = RTC_CNTL_DBIAS_1V10, \
  .rtc_dbias_slp = RTC_CNTL_DBIAS_SLP, \
  .vddsdio_pd_en = ((sleep_flags) & RTC_SLEEP_PD_VDDSDIO) ? 1 : 0, \
  .deep_slp_reject = 1, \
  .light_slp_reject = 1 \
};

#define X32K_CONFIG_DEFAULT() { \
  .dac = 3, \
  .dres = 3, \
  .dgm = 3, \
  .dbuf = 1, \
}

/* Initializer for struct esp32c3_rtc_sleep_pu_config_s
 * which sets all flags to the same value
 */

#define RTC_SLEEP_PU_CONFIG_ALL(val) {\
  .dig_fpu = (val), \
  .rtc_fpu = (val), \
  .cpu_fpu = (val), \
  .i2s_fpu = (val), \
  .bb_fpu = (val), \
  .nrx_fpu = (val), \
  .fe_fpu = (val), \
  .sram_fpu = (val), \
  .rom_ram_fpu = (val), \
}

#define RTC_INIT_CONFIG_DEFAULT() { \
  .wifi_powerup_cycles = OTHER_BLOCKS_POWERUP, \
  .wifi_wait_cycles = OTHER_BLOCKS_WAIT, \
  .bt_powerup_cycles = OTHER_BLOCKS_POWERUP, \
  .bt_wait_cycles = OTHER_BLOCKS_WAIT, \
  .cpu_top_powerup_cycles = OTHER_BLOCKS_POWERUP, \
  .cpu_top_wait_cycles = OTHER_BLOCKS_WAIT, \
  .dg_wrap_powerup_cycles = OTHER_BLOCKS_POWERUP, \
  .dg_wrap_wait_cycles = OTHER_BLOCKS_WAIT, \
  .dg_peri_powerup_cycles = OTHER_BLOCKS_POWERUP, \
  .dg_peri_wait_cycles = OTHER_BLOCKS_WAIT, \
}

/* Default initializer of struct esp32c3_rtc_config_s.
 * This initializer sets all fields to "reasonable" values
 * (e.g. suggested for production use).
 */

