apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
#define RTC_CONFIG_DEFAULT() {\
  .ck8m_wait = RTC_CNTL_CK8M_WAIT_DEFAULT, \
  .xtal_wait = RTC_CNTL_XTL_BUF_WAIT_DEFAULT, \
  .pll_wait  = RTC_CNTL_PLL_BUF_WAIT_DEFAULT, \
  .clkctl_init = 1, \
  .pwrctl_init = 1, \
  .rtc_dboost_fpd = 1, \
  .xtal_fpu = 0, \
  .bbpll_fpu = 0, \
  .cpu_waiti_clk_gate = 1, \
  .cali_ocode = 0\
}

/* The following value is used to get a reasonable rtc voltage dbias value
 * according to digital dbias & some other value storing in efuse
 * (based on ATE 5k ECO3 chips)
 */

#define K_RTC_MID_MUL10000     (215)
#define K_DIG_MID_MUL10000     (213)
#define V_RTC_MID_MUL10000     (10800)
#define V_DIG_MID_MUL10000     (10860)

#define BLOCK1_VERSION         EFUSE_RD_MAC_SPI_SYS_0_REG
#define BLOCK2_VERSION         EFUSE_RD_SYS_DATA_PART1_0_REG

#define DIG_DBIAS_HVT_OFFSET   (165)
#define DIG_DBIAS_HVT_LEN      (5)

#define K_RTC_LDO_OFFSET       (135)
#define K_RTC_LDO_LEN          (7)

#define K_DIG_LDO_OFFSET       (142)
#define K_DIG_LDO_LEN          (7)

#define V_RTC_DBIAS20_OFFSET   (149)
#define V_RTC_DBIAS20_LEN      (8)

#define V_DIG_DBIAS20_OFFSET   (157)
#define V_DIG_DBIAS20_LEN      (8)

#define RTC_CALIB_OFFSET       (128)
#define RTC_CALIB_LEN          (3)

#define OCODE_OFFSET           (140)
#define OCODE_LEN              (8)

#define CHIP_VERSION_OFFSET    (114)
#define CHIP_VERSION_LEN       (3)

#ifdef CONFIG_RTC_DRIVER
/* The magic data for the struct esp32c3_rtc_backup_s that is in RTC slow
 * memory.
 */

#  define MAGIC_RTC_SAVE (UINT64_C(0x11223344556677))
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This is almost the same as esp32c3_rtc_slow_freq_e, except that we define
 * an extra enum member for the external 32k oscillator. For convenience,
 * lower 2 bits should correspond to esp32c3_rtc_slow_freq_e values.
 */

enum esp32c3_slow_clk_sel_e
{
  /* Internal 90 kHz RC oscillator */

  SLOW_CLK_RTC = RTC_SLOW_FREQ_RTC,

  /* External 32 kHz XTAL */

  SLOW_CLK_32K_XTAL = RTC_SLOW_FREQ_32K_XTAL,

  /* Internal 8 MHz RC oscillator, divided by 256 */

  SLOW_CLK_8MD256 = RTC_SLOW_FREQ_8MD256,

  /* External 32k oscillator connected to 32K_XP pin */

  SLOW_CLK_32K_EXT_OSC = RTC_SLOW_FREQ_32K_XTAL | EXT_OSC_FLAG
};

enum reset_reason_e
{
  NO_MEAN                =  0,
  POWERON_RESET          =  1,  /* Vbat power on reset */
  RTC_SW_SYS_RESET       =  3,  /* Software reset digital core */
  DEEPSLEEP_RESET        =  5,  /* Deep Sleep reset digital core */
  SDIO_RESET             =  6,  /* Reset by SLC module, reset digital core */
  TG0WDT_SYS_RESET       =  7,  /* Timer Group0 Watch dog reset digital core */
  TG1WDT_SYS_RESET       =  8,  /* Timer Group1 Watch dog reset digital core */
  RTCWDT_SYS_RESET       =  9,  /* RTC Watch dog Reset digital core */
  INTRUSION_RESET        = 10,  /* Instrusion tested to reset CPU */
  TG0WDT_CPU_RESET       = 11,  /* Timer Group0 reset CPU */
  RTC_SW_CPU_RESET       = 12,  /* Software reset CPU */
  RTCWDT_CPU_RESET       = 13,  /* RTC Watch dog Reset CPU */
  RTCWDT_BROWN_OUT_RESET = 15,  /* Reset when the vdd voltage is not stable */
  RTCWDT_RTC_RESET       = 16,  /* RTC Watch dog reset digital core and rtc module */
  TG1WDT_CPU_RESET       = 17,  /* Timer Group1 reset CPU */
  SUPER_WDT_RESET        = 18,  /* Super watchdog reset digital core and rtc module */
};

/* RTC FAST_CLK frequency values */

enum esp32c3_rtc_fast_freq_e
{
  RTC_FAST_FREQ_XTALD4 = 0,   /* Main XTAL, divided by 4 */
  RTC_FAST_FREQ_8M = 1,       /* Internal 8 MHz RC oscillator */
};

struct esp32c3_x32k_config_s
{
  uint32_t dac : 6;
  uint32_t dres : 3;
  uint32_t dgm : 3;
  uint32_t dbuf: 1;
};

/* Power down flags for rtc_sleep_pd function */

struct esp32c3_rtc_sleep_pu_config_s
{
  uint32_t dig_fpu : 1;     /* Set to 1 to power UP digital part in sleep */
  uint32_t rtc_fpu : 1;     /* Set to 1 to power UP RTC memories in sleep */
  uint32_t cpu_fpu : 1;     /* Set to 1 to power UP digital memories and
                             * CPU in sleep
                             */
  uint32_t i2s_fpu : 1;     /* Set to 1 to power UP I2S in sleep */
  uint32_t bb_fpu : 1;      /* Set to 1 to power UP Wi-Fi in sleep */
  uint32_t nrx_fpu : 1;     /* Set to 1 to power UP Wi-Fi in sleep */
  uint32_t fe_fpu : 1;      /* Set to 1 to power UP Wi-Fi in sleep */
  uint32_t sram_fpu : 1;    /* Set to 1 to power UP SRAM in sleep */
  uint32_t rom_ram_fpu : 1; /* Set to 1 to power UP ROM/IRAM0_DRAM0 in sleep */
};

struct esp32c3_rtc_init_config_s
{
  uint16_t wifi_powerup_cycles : 7;
  uint16_t wifi_wait_cycles : 9;
  uint16_t bt_powerup_cycles : 7;
  uint16_t bt_wait_cycles : 9;
  uint16_t cpu_top_powerup_cycles : 7;
  uint16_t cpu_top_wait_cycles : 9;
  uint16_t dg_wrap_powerup_cycles : 7;
  uint16_t dg_wrap_wait_cycles : 9;
  uint16_t dg_peri_powerup_cycles : 7;
  uint16_t dg_peri_wait_cycles : 9;
};

/* RTC power and clock control initialization settings */

struct esp32c3_rtc_priv_s
{
    uint32_t ck8m_wait : 8;       /* Number of rtc_fast_clk cycles to
                                   * wait for 8M clock to be ready
                                   */
    uint32_t xtal_wait : 8;       /* Number of rtc_fast_clk cycles to
                                   * wait for XTAL clock to be ready
                                   */
    uint32_t pll_wait : 8;        /* Number of rtc_fast_clk cycles to
                                   * wait for PLL to be ready
                                   */
    uint32_t clkctl_init : 1;     /* Perform clock control related initialization */
    uint32_t pwrctl_init : 1;     /* Perform power control related initialization */
    uint32_t rtc_dboost_fpd : 1;  /* Force power down RTC_DBOOST */
    uint32_t xtal_fpu : 1;
    uint32_t bbpll_fpu : 1;
    uint32_t cpu_waiti_clk_gate : 1;
    uint32_t cali_ocode : 1;      /* Calibrate Ocode to make bangap voltage more precise. */
};

