apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
/* sleep configuration for rtc_sleep_init function */

struct esp32c3_rtc_sleep_config_s
{
  uint32_t lslp_mem_inf_fpu : 1;       /* force normal voltage in sleep mode */
  uint32_t rtc_mem_inf_follow_cpu : 1; /* keep low voltage in sleep mode */
  uint32_t rtc_fastmem_pd_en : 1;      /* power down RTC fast memory */
  uint32_t rtc_slowmem_pd_en : 1;      /* power down RTC slow memory */
  uint32_t rtc_peri_pd_en : 1;         /* power down RTC peripherals */
  uint32_t wifi_pd_en : 1;             /* power down Wi-Fi */
  uint32_t bt_pd_en : 1;               /* power down BT */
  uint32_t cpu_pd_en : 1;              /* power down CPU, but not
                                        * restart when lightsleep.
                                        */
  uint32_t dig_peri_pd_en : 1;         /* power down digital peripherals */
  uint32_t deep_slp : 1;               /* power down digital domain */
  uint32_t wdt_flashboot_mod_en : 1;   /* enable WDT flashboot mode */
  uint32_t dig_dbias_wak : 5;          /* set bias for digital domain,
                                        * in active mode
                                        */
  uint32_t dig_dbias_slp : 5;          /* set bias for digital domain,
                                        * in sleep mode
                                        */
  uint32_t rtc_dbias_wak : 5;          /* set bias for RTC domain, in active mode */
  uint32_t rtc_dbias_slp : 5;          /* set bias for RTC domain, in sleep mode */
  uint32_t vddsdio_pd_en : 1;          /* power down VDDSDIO regulator */
  uint32_t deep_slp_reject : 1;
  uint32_t light_slp_reject : 1;
};

#ifdef CONFIG_RTC_DRIVER

#ifdef CONFIG_RTC_ALARM
struct alm_cbinfo_s
{
  struct rt_timer_s *alarm_hdl;  /* Timer id point to here */
  volatile alm_callback_t ac_cb; /* Client callback function */
  volatile void *ac_arg;         /* Argument to pass with the callback function */
  uint64_t deadline_us;
  uint8_t index;
};
#endif

struct esp32c3_rtc_backup_s
{
  uint64_t magic;
  int64_t  offset;              /* Offset time from RTC HW value */
  int64_t  reserved0;
};

#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_RTC_DRIVER

/* Callback to use when the alarm expires */

#ifdef CONFIG_RTC_ALARM
static struct alm_cbinfo_s g_alarmcb[RTC_ALARM_LAST];
#endif

static RTC_DATA_ATTR struct esp32c3_rtc_backup_s rtc_saved_data;

/* Saved data for persistent RTC time */

static struct esp32c3_rtc_backup_s *g_rtc_save;
static bool g_rt_timer_enabled = false;
static spinlock_t g_rtc_lock = SP_UNLOCKED;

#endif

static uint8_t ref_counts[PERIPH_MODULE_MAX] =
{
  0
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void IRAM_ATTR esp32c3_rtc_sleep_pu(
                      struct esp32c3_rtc_sleep_pu_config_s cfg);
static inline bool esp32c3_clk_val_is_valid(uint32_t val);
static uint32_t IRAM_ATTR esp32c3_rtc_clk_cal_internal(
                enum esp32c3_rtc_cal_sel_e cal_clk, uint32_t slowclk_cycles);
static void IRAM_ATTR esp32c3_rtc_clk_32k_enable(bool enable);
static void IRAM_ATTR esp32c3_rtc_clk_8m_enable(
                                bool clk_8m_en, bool d256_en);
static uint32_t IRAM_ATTR esp32c3_rtc_clk_slow_freq_get_hz(void);
static void IRAM_ATTR esp32c3_select_rtc_slow_clk(
                      enum esp32c3_slow_clk_sel_e slow_clk);
static void IRAM_ATTR esp32c3_rtc_clk_fast_freq_set(
                      enum esp32c3_rtc_fast_freq_e fast_freq);
static uint32_t IRAM_ATTR esp32c3_rtc_sleep_finish(uint32_t
                                          lslp_mem_inf_fpu);
static void IRAM_ATTR esp32c3_rtc_clk_apb_freq_update(uint32_t apb_freq);
static void IRAM_ATTR esp32c3_wait_dig_dbias_valid(uint64_t rtc_cycles);
static void IRAM_ATTR esp32c3_rtc_update_to_xtal(int freq, int div);
static void IRAM_ATTR esp32c3_rtc_clk_bbpll_disable(void);
static void IRAM_ATTR esp32c3_rtc_bbpll_configure(
                     enum esp32c3_rtc_xtal_freq_e xtal_freq, int pll_freq);
static void IRAM_ATTR esp32c3_rtc_clk_cpu_freq_to_8m(void);
static void IRAM_ATTR esp32c3_rtc_clk_cpu_freq_to_pll_mhz(
                                             int cpu_freq_mhz);

#ifdef CONFIG_RTC_DRIVER
static void IRAM_ATTR esp32c3_rt_cb_handler(void *arg);
#endif

static void esp32c3_periph_module_enable(
            enum esp32c3_periph_module_e periph);
static uint32_t IRAM_ATTR esp32c3_periph_ll_get_clk_en_reg(
                            enum esp32c3_periph_module_e periph);
static inline uint32_t IRAM_ATTR esp32c3_periph_ll_get_clk_en_mask(
                            enum esp32c3_periph_module_e periph);
static uint32_t IRAM_ATTR esp32c3_periph_ll_get_rst_en_reg(
                            enum esp32c3_periph_module_e periph);
static inline uint32_t IRAM_ATTR esp32c3_periph_ll_get_rst_en_mask
              (enum esp32c3_periph_module_e periph, bool enable);
static uint32_t esp32c3_get_rtc_dbias_by_efuse(uint8_t chip_version,
                                               uint32_t dig_dbias);
static uint32_t esp32c3_read_efuse(uint32_t addr, uint32_t b_off,
                                                uint32_t b_size);
static void esp32c3_set_rtc_dig_dbias(void);
static void esp32c3_rtc_calibrate_ocode(void);

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_RTC_DRIVER
volatile bool g_rtc_enabled = false;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/* Pauses execution for us microseconds */

extern void esp_rom_delay_us(uint32_t us);

/* Set the real CPU ticks per us to the ets, so that ets_delay_us
 * will be accurate. Call this function when CPU frequency is changed.
 */

extern void ets_update_cpu_frequency(uint32_t ticks_per_us);

/* Get the reset reason for CPU. */

