apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
extern enum reset_reason_e rtc_get_reset_reason(int cpu_no);

/****************************************************************************
 * Name: esp32c3_rtc_sleep_pu
 *
 * Description:
 *   Configure whether certain peripherals are powered down in deep sleep.
 *
 * Input Parameters:
 *   cfg - power down flags as esp32c3_rtc_sleep_pu_config_s structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp32c3_rtc_sleep_pu(
                 struct esp32c3_rtc_sleep_pu_config_s cfg)
{
  REG_SET_FIELD(RTC_CNTL_DIG_PWC_REG,
                RTC_CNTL_LSLP_MEM_FORCE_PU, cfg.dig_fpu);
  REG_SET_FIELD(RTC_CNTL_PWC_REG, RTC_CNTL_FASTMEM_FORCE_LPU, cfg.rtc_fpu);
  REG_SET_FIELD(APB_CTRL_FRONT_END_MEM_PD_REG,
                APB_CTRL_DC_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(APB_CTRL_FRONT_END_MEM_PD_REG,
                APB_CTRL_PBUS_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(APB_CTRL_FRONT_END_MEM_PD_REG,
                APB_CTRL_AGC_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(BBPD_CTRL, BB_FFT_FORCE_PU, cfg.bb_fpu);
  REG_SET_FIELD(BBPD_CTRL, BB_DC_EST_FORCE_PU, cfg.bb_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_RX_ROT_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_VIT_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_DEMAP_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(FE_GEN_CTRL, FE_IQ_EST_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(FE2_TX_INTERP_CTRL, FE2_TX_INF_FORCE_PU, cfg.fe_fpu);
  if (cfg.sram_fpu)
    {
      REG_SET_FIELD(APB_CTRL_MEM_POWER_UP_REG,
                    APB_CTRL_SRAM_POWER_UP, APB_CTRL_SRAM_POWER_UP);
    }
  else
    {
      REG_SET_FIELD(APB_CTRL_MEM_POWER_UP_REG,
                    APB_CTRL_SRAM_POWER_UP, 0);
    }

  if (cfg.rom_ram_fpu)
    {
      REG_SET_FIELD(APB_CTRL_MEM_POWER_UP_REG,
                    APB_CTRL_ROM_POWER_UP, APB_CTRL_ROM_POWER_UP);
    }
  else
    {
      REG_SET_FIELD(APB_CTRL_MEM_POWER_UP_REG,
                    APB_CTRL_ROM_POWER_UP, 0);
    }
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_fast_freq_set
 *
 * Description:
 *   Select source for RTC_FAST_CLK.
 *
 * Input Parameters:
 *   fast_freq - Clock source (one of enum esp32c3_rtc_fast_freq_e values)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp32c3_rtc_clk_fast_freq_set(
                      enum esp32c3_rtc_fast_freq_e fast_freq)
{
  REG_SET_FIELD(RTC_CNTL_CLK_CONF_REG,
                RTC_CNTL_FAST_CLK_RTC_SEL, fast_freq);
  esp_rom_delay_us(DELAY_FAST_CLK_SWITCH);
}

/****************************************************************************
 * Name: esp32c3_clk_val_is_valid
 *
 * Description:
 *   Values of RTC_XTAL_FREQ_REG and RTC_APB_FREQ_REG are
 *   stored as two copies in lower and upper 16-bit halves.
 *   These are the routines to work with such a representation.
 *
 * Input Parameters:
 *   val - register value
 *
 * Returned Value:
 *   true:  Valid register value.
 *   false: Invalid register value.
 *
 ****************************************************************************/

static inline bool esp32c3_clk_val_is_valid(uint32_t val)
{
  return (val & 0xffff) == ((val >> 16) & 0xffff)
                        && val != 0 && val != UINT32_MAX;
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_cal_internal
 *
 * Description:
 *   Clock calibration function used by rtc_clk_cal and rtc_clk_cal_ratio
 *
 * Input Parameters:
 *   cal_clk        - which clock to calibrate
 *   slowclk_cycles - number of slow clock cycles to count.
 *
 * Returned Value:
 *   Number of XTAL clock cycles within the given number of slow clock cycles
 *
 ****************************************************************************/

static uint32_t IRAM_ATTR esp32c3_rtc_clk_cal_internal(
                enum esp32c3_rtc_cal_sel_e cal_clk, uint32_t slowclk_cycles)
{
  uint32_t cal_val;
  uint32_t expected_freq;
  uint32_t us_time_estimate;
  int dig_32k_xtal_state;
  enum esp32c3_rtc_slow_freq_e slow_freq;
  if (cal_clk == RTC_CAL_RTC_MUX)
    {
      slow_freq = REG_GET_FIELD(RTC_CNTL_CLK_CONF_REG,
                                RTC_CNTL_ANA_CLK_RTC_SEL);
      if (slow_freq == RTC_SLOW_FREQ_32K_XTAL)
        {
          cal_clk = RTC_CAL_32K_XTAL;
        }
      else if (slow_freq == RTC_SLOW_FREQ_8MD256)
        {
          cal_clk = RTC_CAL_8MD256;
        }
    }

  /* Enable requested clock (150k clock is always on) */

  dig_32k_xtal_state = REG_GET_FIELD(RTC_CNTL_CLK_CONF_REG,
                                         RTC_CNTL_DIG_XTAL32K_EN);

  if (cal_clk == RTC_CAL_32K_XTAL && !dig_32k_xtal_state)
    {
      REG_SET_FIELD(RTC_CNTL_CLK_CONF_REG, RTC_CNTL_DIG_XTAL32K_EN, 1);
    }

  if (cal_clk == RTC_CAL_8MD256)
    {
      modifyreg32(RTC_CNTL_CLK_CONF_REG, 0, RTC_CNTL_DIG_CLK8M_D256_EN);
    }

  /* Prepare calibration */

  REG_SET_FIELD(TIMG_RTCCALICFG_REG(0), TIMG_RTC_CALI_CLK_SEL, cal_clk);

  /* There may be another calibration process already running during we
   * call this function, so we should wait the last process is done.
   */

  if ((getreg32(TIMG_RTCCALICFG2_REG(0)) & TIMG_RTC_CALI_TIMEOUT) == 0)
    {
      if (getreg32(TIMG_RTCCALICFG_REG(0)) & TIMG_RTC_CALI_START_CYCLING)
        {
          while ((getreg32(TIMG_RTCCALICFG_REG(0)) &
                  TIMG_RTC_CALI_RDY) == 0);
        }
    }

  modifyreg32(TIMG_RTCCALICFG_REG(0), TIMG_RTC_CALI_START_CYCLING, 0);
  REG_SET_FIELD(TIMG_RTCCALICFG_REG(0), TIMG_RTC_CALI_MAX, slowclk_cycles);

  /* Set timeout reg and expect time delay */

  if (cal_clk == RTC_CAL_32K_XTAL)
    {
      REG_SET_FIELD(TIMG_RTCCALICFG2_REG(0), TIMG_RTC_CALI_TIMEOUT_THRES,
                    RTC_SLOW_CLK_X32K_CAL_TIMEOUT_THRES(slowclk_cycles));
      expected_freq = RTC_SLOW_CLK_FREQ_32K;
    }
  else if (cal_clk == RTC_CAL_8MD256)
    {
      REG_SET_FIELD(TIMG_RTCCALICFG2_REG(0), TIMG_RTC_CALI_TIMEOUT_THRES,
                    RTC_SLOW_CLK_8MD256_CAL_TIMEOUT_THRES(slowclk_cycles));
      expected_freq = RTC_SLOW_CLK_FREQ_8MD256;
    }
  else
    {
      REG_SET_FIELD(TIMG_RTCCALICFG2_REG(0),
                    (uint32_t)TIMG_RTC_CALI_TIMEOUT_THRES,
                    RTC_SLOW_CLK_150K_CAL_TIMEOUT_THRES(slowclk_cycles));
      expected_freq = RTC_SLOW_CLK_FREQ_90K;
    }

