apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
      case PERIPH_SPI2_MODULE:
        return SYSTEM_SPI2_CLK_EN;

      case PERIPH_TWAI_MODULE:
        return SYSTEM_TWAI_CLK_EN;

      case PERIPH_GDMA_MODULE:
        return SYSTEM_DMA_CLK_EN;

      case PERIPH_AES_MODULE:
        return SYSTEM_CRYPTO_AES_CLK_EN;

      case PERIPH_SHA_MODULE:
        return SYSTEM_CRYPTO_SHA_CLK_EN;

      case PERIPH_RSA_MODULE:
        return SYSTEM_CRYPTO_RSA_CLK_EN;

      case PERIPH_HMAC_MODULE:
        return SYSTEM_CRYPTO_HMAC_CLK_EN;

      case PERIPH_DS_MODULE:
        return SYSTEM_CRYPTO_DS_CLK_EN;

      case PERIPH_RNG_MODULE:
        return SYSTEM_WIFI_CLK_RNG_EN;

      case PERIPH_WIFI_MODULE:
        return SYSTEM_WIFI_CLK_WIFI_EN_M;

      case PERIPH_BT_MODULE:
        return SYSTEM_WIFI_CLK_BT_EN_M;

      case PERIPH_WIFI_BT_COMMON_MODULE:
        return SYSTEM_WIFI_CLK_WIFI_BT_COMMON_M;

      case PERIPH_BT_BASEBAND_MODULE:
        return SYSTEM_BT_BASEBAND_EN;

      case PERIPH_BT_LC_MODULE:
        return SYSTEM_BT_LC_EN;

      default:
        return 0;
    }
}

/****************************************************************************
 * Name: esp32c3_periph_ll_get_rst_en_reg
 *
 * Description:
 *   Get system reset register through periph module
 *
 * Input Parameters:
 *   periph - Periph module (one of enum esp32c3_periph_module_e values)
 *
 * Returned Value:
 *   System reset register
 *
 ****************************************************************************/

static uint32_t IRAM_ATTR esp32c3_periph_ll_get_rst_en_reg(
                            enum esp32c3_periph_module_e periph)
{
  switch (periph)
    {
      case PERIPH_RNG_MODULE:
      case PERIPH_WIFI_MODULE:
      case PERIPH_BT_MODULE:
      case PERIPH_WIFI_BT_COMMON_MODULE:
      case PERIPH_BT_BASEBAND_MODULE:
      case PERIPH_BT_LC_MODULE:
        return SYSTEM_WIFI_RST_EN_REG;

      case PERIPH_HMAC_MODULE:
      case PERIPH_DS_MODULE:
      case PERIPH_AES_MODULE:
      case PERIPH_RSA_MODULE:
      case PERIPH_SHA_MODULE:
      case PERIPH_GDMA_MODULE:
        return SYSTEM_PERIP_RST_EN1_REG;

      default:
        return SYSTEM_PERIP_RST_EN0_REG;
    }
}

/****************************************************************************
 * Name: esp32c3_periph_ll_get_rst_en_mask
 *
 * Description:
 *   Get system reset bit through periph module
 *
 * Input Parameters:
 *   periph - Periph module (one of enum esp32c3_periph_module_e values)
 *   enable - Whether hardware acceleration is enabled
 *
 * Returned Value:
 *   System reset bit
 *
 ****************************************************************************/

static inline uint32_t IRAM_ATTR esp32c3_periph_ll_get_rst_en_mask
              (enum esp32c3_periph_module_e periph, bool enable)
{
  switch (periph)
    {
      case PERIPH_SARADC_MODULE:
        return SYSTEM_APB_SARADC_RST;

      case PERIPH_RMT_MODULE:
        return SYSTEM_RMT_RST;

      case PERIPH_LEDC_MODULE:
        return SYSTEM_LEDC_RST;

      case PERIPH_UART0_MODULE:
        return SYSTEM_UART_RST;

      case PERIPH_UART1_MODULE:
        return SYSTEM_UART1_RST;

      case PERIPH_I2C0_MODULE:
        return SYSTEM_I2C_EXT0_RST;

      case PERIPH_I2S1_MODULE:
        return SYSTEM_I2S1_RST;

      case PERIPH_TIMG0_MODULE:
        return SYSTEM_TIMERGROUP_RST;

      case PERIPH_TIMG1_MODULE:
        return SYSTEM_TIMERGROUP1_RST;

      case PERIPH_UHCI0_MODULE:
        return SYSTEM_UHCI0_RST;

      case PERIPH_SYSTIMER_MODULE:
        return SYSTEM_SYSTIMER_RST;

      case PERIPH_GDMA_MODULE:
        return SYSTEM_DMA_RST;

      case PERIPH_SPI_MODULE:
        return SYSTEM_SPI01_RST;

      case PERIPH_SPI2_MODULE:
        return SYSTEM_SPI2_RST;

      case PERIPH_TWAI_MODULE:
        return SYSTEM_TWAI_RST;

      case PERIPH_HMAC_MODULE:
        return SYSTEM_CRYPTO_HMAC_RST;

      case PERIPH_AES_MODULE:
        if (enable == true)
          {
            /* Clear reset on digital signature,
              * otherwise AES unit is held in reset also.
              */

            return (SYSTEM_CRYPTO_AES_RST | SYSTEM_CRYPTO_DS_RST);
          }

        /* Don't return other units to reset,
         * as this pulls reset on RSA & SHA units, respectively.
         */

        return SYSTEM_CRYPTO_AES_RST;

      case PERIPH_SHA_MODULE:
        if (enable == true)
          {
            /* Clear reset on digital signature and HMAC,
             * otherwise SHA is held in reset
             */

            return (SYSTEM_CRYPTO_SHA_RST |
                    SYSTEM_CRYPTO_DS_RST | SYSTEM_CRYPTO_HMAC_RST);
          }

        /* Don't assert reset on secure boot,
         * otherwise AES is held in reset
         */

        return SYSTEM_CRYPTO_SHA_RST;

      case PERIPH_RSA_MODULE:
        if (enable == true)
          {
          /* also clear reset on digital signature,
           * otherwise RSA is held in reset
           */

            return (SYSTEM_CRYPTO_RSA_RST | SYSTEM_CRYPTO_DS_RST);
          }

        /* don't reset digital signature unit,
         * as this resets AES also.
         */

        return SYSTEM_CRYPTO_RSA_RST;

      case PERIPH_DS_MODULE:
        return SYSTEM_CRYPTO_DS_RST;

      default:
        return 0;
    }
}

/****************************************************************************
 * Name: esp32c3_periph_module_enable
 *
 * Description:
 *   Enable peripheral module
 *
 * Input Parameters:
 *   periph - Periph module (one of enum esp32c3_periph_module_e values)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32c3_periph_module_enable(enum esp32c3_periph_module_e periph)
{
  irqstate_t flags = enter_critical_section();

  ASSERT(periph < PERIPH_MODULE_MAX);
  if (ref_counts[periph] == 0)
    {
      modifyreg32(esp32c3_periph_ll_get_clk_en_reg(periph), 0,
                  esp32c3_periph_ll_get_clk_en_mask(periph));
      modifyreg32(esp32c3_periph_ll_get_rst_en_reg(periph),
                  esp32c3_periph_ll_get_rst_en_mask(periph, true), 0);
    }

  ref_counts[periph]++;

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: esp32c3_read_efuse
 *
 * Description:
 *   Read Efuse data.
 *
 * Input Parameters:
 *   addr   - register address
 *   b_off  - bit offset
 *   b_size - bit size
 *
 * Returned Value:
 *  Efuse data.
 *
 ****************************************************************************/

static uint32_t esp32c3_read_efuse(uint32_t addr, uint32_t b_off,
                                                 uint32_t b_size)
{
  uint32_t data;
  uint32_t regval;
  uint32_t shift = 32 - b_size;
  uint32_t mask = UINT32_MAX >> shift;
  uint32_t res = b_off % 32;
  uint32_t regaddr = addr + (b_off / 32 * 4);

  regval = getreg32(regaddr);
  data = regval >> res;
  if (res <= shift)
    {
      data &= mask;
    }
  else
    {
      shift = 32 - res;

