apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
      regval = getreg32(regaddr + 4);
      data |= (regval & (mask >> shift)) << shift;
    }

  return data;
}

/****************************************************************************
 * Name: esp32c3_get_rtc_dbias_by_efuse
 *
 * Description:
 *   Get RTC voltage from efuse
 *
 * Input Parameters:
 *   chip_version - Chip version
 *   dig_dbias    - Digital voltage
 *
 * Returned Value:
 *   RTC voltage
 *
 ****************************************************************************/

static uint32_t esp32c3_get_rtc_dbias_by_efuse(uint8_t chip_version,
                                                 uint32_t dig_dbias)
{
  ASSERT(chip_version >= 3);
  int k_rtc_ldo_real_mul10000;
  int k_dig_ldo_real_mul10000;
  uint32_t rtc_dbias = 0;
  uint32_t v_rtc_dbias20_real_mul10000;
  uint32_t v_dig_dbias20_real_mul10000;
  uint32_t v_dig_nearest_1v15_mul10000;
  uint32_t v_rtc_nearest_1v15_mul10000 = 0;
  int k_rtc_ldo = esp32c3_read_efuse(BLOCK1_VERSION, K_RTC_LDO_OFFSET,
                                     K_RTC_LDO_LEN);
  int k_dig_ldo = esp32c3_read_efuse(BLOCK1_VERSION, K_DIG_LDO_OFFSET,
                                     K_DIG_LDO_LEN);
  int v_rtc_bias20 = esp32c3_read_efuse(BLOCK1_VERSION, V_RTC_DBIAS20_OFFSET,
                                     V_RTC_DBIAS20_LEN);
  int v_dig_bias20 = esp32c3_read_efuse(BLOCK1_VERSION, V_DIG_DBIAS20_OFFSET,
                                     V_DIG_DBIAS20_LEN);
  k_rtc_ldo =  ((k_rtc_ldo & BIT(6)) != 0) ?
               -(k_rtc_ldo & 0x3f): k_rtc_ldo;
  k_dig_ldo =  ((k_dig_ldo & BIT(6)) != 0) ?
               -(k_dig_ldo & 0x3f): (uint8_t)k_dig_ldo;
  v_rtc_bias20 =  ((v_rtc_bias20 & BIT(7)) != 0) ?
                  -(v_rtc_bias20 & 0x7f): (uint8_t)v_rtc_bias20;
  v_dig_bias20 =  ((v_dig_bias20 & BIT(7)) != 0) ?
                  -(v_dig_bias20 & 0x7f): (uint8_t)v_dig_bias20;
  v_rtc_dbias20_real_mul10000 = V_RTC_MID_MUL10000 +
                              v_rtc_bias20 * 10000 / 500;
  v_dig_dbias20_real_mul10000 = V_DIG_MID_MUL10000 +
                              v_dig_bias20 * 10000 / 500;
  k_rtc_ldo_real_mul10000 = K_RTC_MID_MUL10000 + k_rtc_ldo;
  k_dig_ldo_real_mul10000 = K_DIG_MID_MUL10000 + k_dig_ldo;
  v_dig_nearest_1v15_mul10000 = v_dig_dbias20_real_mul10000 +
                    k_dig_ldo_real_mul10000 * (dig_dbias - 20);
  for (rtc_dbias = 15; rtc_dbias < 31; rtc_dbias++)
    {
      v_rtc_nearest_1v15_mul10000 = v_rtc_dbias20_real_mul10000 +
                          k_rtc_ldo_real_mul10000 * (rtc_dbias - 20);
      if (v_rtc_nearest_1v15_mul10000 >= v_dig_nearest_1v15_mul10000 - 250)
        {
          break;
        }
    }

  return rtc_dbias;
}

/****************************************************************************
 * Name: esp32c3_set_rtc_dig_dbias
 *
 * Description:
 *   Configure RTC and digital voltage.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32c3_set_rtc_dig_dbias(void)
{
  /* A reasonable dig_dbias which by scanning pvt to make 160 CPU run
   * successful stored in efuse, we store some value in efuse, include:
   * k_rtc_ldo (slope of rtc voltage & rtc_dbias);
   * k_dig_ldo (slope of digital voltage & digital_dbias);
   * v_rtc_bias20 (rtc voltage when rtc dbais is 20);
   * v_dig_bias20 (digital voltage when digital dbais is 20).
   * a reasonable rtc_dbias can be calculated by a certion formula.
   */

  uint32_t rtc_dbias = 28;
  uint32_t dig_dbias = 28;
  uint32_t chip_version = esp32c3_read_efuse(BLOCK1_VERSION,
                              CHIP_VERSION_OFFSET, CHIP_VERSION_LEN);
  if (chip_version >= 3)
    {
      /* Get digital voltage from efuse */

      dig_dbias = esp32c3_read_efuse(BLOCK1_VERSION, DIG_DBIAS_HVT_OFFSET,
                                     DIG_DBIAS_HVT_LEN);
      if (dig_dbias != 0)
        {
          if (dig_dbias + 4 > 28)
            {
              dig_dbias = 28;
            }
          else
            {
              dig_dbias += 4;
            }

          /* Get RTC voltage from efuse */

          rtc_dbias = esp32c3_get_rtc_dbias_by_efuse(chip_version,
                                                     dig_dbias);
        }
      else
        {
          dig_dbias = 28;
        }
    }

  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_RTC_DREG, rtc_dbias);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_DIG_DREG, dig_dbias);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_periph_ll_periph_enabled
 *
 * Description:
 *   Whether the current Periph module is enabled
 *
 * Input Parameters:
 *   periph - Periph module (one of enum esp32c3_periph_module_e values)
 *
 * Returned Value:
 *   Periph module is enabled or not
 *
 ****************************************************************************/

bool IRAM_ATTR esp32c3_periph_ll_periph_enabled(
                                     enum esp32c3_periph_module_e periph)
{
  return ((getreg32(esp32c3_periph_ll_get_rst_en_reg(periph)) &
           esp32c3_periph_ll_get_rst_en_mask(periph, false)) == 0) &&
         ((getreg32(esp32c3_periph_ll_get_clk_en_reg(periph)) &
           esp32c3_periph_ll_get_clk_en_mask(periph)) != 0);
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_xtal_freq_get
 *
 * Description:
 *   Get main XTAL frequency
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   XTAL frequency (one of enum esp32c3_rtc_xtal_freq_e values)
 *
 ****************************************************************************/

enum esp32c3_rtc_xtal_freq_e IRAM_ATTR
            esp32c3_rtc_clk_xtal_freq_get(void)
{
  /* We may have already written XTAL value into RTC_XTAL_FREQ_REG */

  uint32_t xtal_freq_reg = getreg32(RTC_XTAL_FREQ_REG);
  if (!esp32c3_clk_val_is_valid(xtal_freq_reg))
    {
      return RTC_XTAL_FREQ_40M;
    }

  return (xtal_freq_reg & UINT16_MAX);
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_slow_freq_set
 *
 * Description:
 *   Select source for RTC_SLOW_CLK
 *
 * Input Parameters:
 *   slow_freq - clock source (one of esp32c3_rtc_slow_freq_e values)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32c3_rtc_clk_slow_freq_set(
                           enum esp32c3_rtc_slow_freq_e slow_freq)
{
  REG_SET_FIELD(RTC_CNTL_CLK_CONF_REG, (uint32_t)RTC_CNTL_ANA_CLK_RTC_SEL,
                slow_freq);

