apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rtc.c
  /* Why we need to connect this clock to digital? Or maybe this clock
   * should be connected to digital when xtal 32k clock is enabled instead?
   */

  REG_SET_FIELD(RTC_CNTL_CLK_CONF_REG, RTC_CNTL_DIG_XTAL32K_EN,
                (slow_freq == RTC_SLOW_FREQ_32K_XTAL) ? 1 : 0);

  /* The clk_8m_d256 will be closed when rtc_state in SLEEP,
   * so if the slow_clk is 8md256, clk_8m must be force power on
   */

  REG_SET_FIELD(RTC_CNTL_CLK_CONF_REG, RTC_CNTL_CK8M_FORCE_PU,
               (slow_freq == RTC_SLOW_FREQ_8MD256) ? 1 : 0);
  esp_rom_delay_us(DELAY_SLOW_CLK_SWITCH);
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_slow_freq_get
 *
 * Description:
 *   Get the RTC_SLOW_CLK source
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Currently selected clock source
 *   (one of enum esp32c3_rtc_slow_freq_e values)
 *
 ****************************************************************************/

enum esp32c3_rtc_slow_freq_e IRAM_ATTR esp32c3_rtc_clk_slow_freq_get(void)
{
  return REG_GET_FIELD(RTC_CNTL_CLK_CONF_REG, RTC_CNTL_ANA_CLK_RTC_SEL);
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_cal
 *
 * Description:
 *   Measure RTC slow clock's period, based on main XTAL frequency
 *
 * Input Parameters:
 *   cal_clk        - clock to be measured
 *   slowclk_cycles - number of slow clock cycles to average
 *
 * Returned Value:
 *   Average slow clock period in microseconds, Q13.19 fixed point format
 *   or 0 if calibration has timed out
 *
 ****************************************************************************/

uint32_t IRAM_ATTR esp32c3_rtc_clk_cal(enum esp32c3_rtc_cal_sel_e cal_clk,
                                                     uint32_t slowclk_cycles)
{
  enum esp32c3_rtc_xtal_freq_e xtal_freq;
  uint64_t xtal_cycles;
  uint64_t divider;
  uint64_t period_64;
  uint32_t period;

  xtal_freq = esp32c3_rtc_clk_xtal_freq_get();
  xtal_cycles = esp32c3_rtc_clk_cal_internal(cal_clk, slowclk_cycles);
  divider = ((uint64_t)xtal_freq) * slowclk_cycles;
  period_64 = ((xtal_cycles << RTC_CLK_CAL_FRACT) + divider / 2 - 1)
                                                          / divider;
  period = (uint32_t)(period_64 & UINT32_MAX);

  return period;
}

/****************************************************************************
 * Name: esp32c3_rtc_clk_set
 *
 * Description:
 *   Set RTC CLK frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32c3_rtc_clk_set(void)
{
  ASSERT(esp32c3_rtc_clk_xtal_freq_get() == RTC_XTAL_FREQ_40M);
  esp32c3_rtc_clk_fast_freq_set(RTC_FAST_FREQ_8M);
  esp32c3_select_rtc_slow_clk(RTC_SLOW_FREQ_RTC);
}

/****************************************************************************
 * Name: esp32c3_rtc_init
 *
 * Description:
 *   Initialize RTC clock and power control related functions.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32c3_rtc_init(void)
{
  struct esp32c3_rtc_priv_s cfg = RTC_CONFIG_DEFAULT();
  struct esp32c3_rtc_init_config_s rtc_init_cfg = RTC_INIT_CONFIG_DEFAULT();

  /* If this pd_cfg is set to 1, all memory won't
   * enter low power mode during light sleep.
   * If this pd_cfg is set to 0, all memory will
   * enter low power mode during light sleep
   */

  struct esp32c3_rtc_sleep_pu_config_s pu_cfg = RTC_SLEEP_PU_CONFIG_ALL(0);
  if (rtc_get_reset_reason(0) == POWERON_RESET)
    {
      cfg.cali_ocode = 1;
    }

  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_XPD_DIG_REG, 0);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_XPD_RTC_REG, 0);
  modifyreg32(RTC_CNTL_ANA_CONF_REG, RTC_CNTL_PVTMON_PU, 0);
  REG_SET_FIELD(RTC_CNTL_TIMER1_REG, (uint32_t)RTC_CNTL_PLL_BUF_WAIT,
                cfg.pll_wait);
  REG_SET_FIELD(RTC_CNTL_TIMER1_REG, RTC_CNTL_CK8M_WAIT, cfg.ck8m_wait);
  REG_SET_FIELD(RTC_CNTL_TIMER5_REG, RTC_CNTL_MIN_SLP_VAL,
                RTC_CNTL_MIN_SLP_VAL_MIN);

  /* set default powerup & wait time */

  REG_SET_FIELD(RTC_CNTL_TIMER3_REG, RTC_CNTL_WIFI_POWERUP_TIMER,
                rtc_init_cfg.wifi_powerup_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER3_REG, RTC_CNTL_WIFI_WAIT_TIMER,
                rtc_init_cfg.wifi_wait_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER3_REG, (uint32_t)RTC_CNTL_BT_POWERUP_TIMER,
                rtc_init_cfg.bt_powerup_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER3_REG, RTC_CNTL_BT_WAIT_TIMER,
                rtc_init_cfg.bt_wait_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER4_REG, RTC_CNTL_CPU_TOP_POWERUP_TIMER,
                rtc_init_cfg.cpu_top_powerup_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER4_REG, RTC_CNTL_CPU_TOP_WAIT_TIMER,
                rtc_init_cfg.cpu_top_wait_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER4_REG,
                (uint32_t)RTC_CNTL_DG_WRAP_POWERUP_TIMER,
                rtc_init_cfg.dg_wrap_powerup_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER4_REG, RTC_CNTL_DG_WRAP_WAIT_TIMER,
                rtc_init_cfg.dg_wrap_wait_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER6_REG,
                (uint32_t)RTC_CNTL_DG_PERI_POWERUP_TIMER,
                rtc_init_cfg.dg_peri_powerup_cycles);
  REG_SET_FIELD(RTC_CNTL_TIMER6_REG, RTC_CNTL_DG_PERI_WAIT_TIMER,
                rtc_init_cfg.dg_peri_wait_cycles);

  if (cfg.cali_ocode)
    {
      uint32_t rtc_calib_version = esp32c3_read_efuse(BLOCK2_VERSION,
                                       RTC_CALIB_OFFSET, RTC_CALIB_LEN);
      if (rtc_calib_version == 1)
        {
          /* use efuse ocode */

          uint32_t ocode = esp32c3_read_efuse(BLOCK2_VERSION, OCODE_OFFSET,
                                              OCODE_LEN);
          REGI2C_WRITE_MASK(I2C_ULP, I2C_ULP_EXT_CODE, ocode);
          REGI2C_WRITE_MASK(I2C_ULP, I2C_ULP_IR_FORCE_CODE, 1);
        }
      else
        {
          esp32c3_rtc_calibrate_ocode();
        }
    }

